{
  "approach": {
    "title": "Approach to Software Development",
    "media": {
      "heroImage": "", 
      "video": "",
      "gallery": []
    },
    "overview": {
      "description": "Software development refers to the structured process of creating, designing, deploying, and supporting software systems. Software consists of instructions that make hardware programmable, abstracting physical (transistor-level) operations into logical, usable systems.",
      "technicalContext": "At the lowest level, computation relies on physical transistor operations where electronic signals represent binary states (1s and 0s). Modern software builds layers of abstraction on top of this foundation to deliver reliable, scalable systems."
    },
    "softwareCategories": {
      "systemSoftware": {
        "description": "System software acts as the foundational layer of a device, managing hardware resources and providing core operational capabilities.",
        "components": [
          "Operating Systems (Windows, macOS, Linux, iOS, Android)",
          "Device Drivers for hardware communication",
          "System Utilities for maintenance, security, and optimization",
          "Firmware such as BIOS/UEFI",
          "Language Translators including compilers and interpreters"
        ]
      },
      "programmingSoftware": {
        "description": "Programming software provides tools for developers to write, test, debug, and maintain source code.",
        "tools": ["Text Editors", "Compilers", "Linkers", "Debuggers"]
      },
      "applicationSoftware": {
        "description": "Application software enables end users to perform specific tasks across desktop, web, and mobile platforms.",
        "examples": ["Productivity tools", "Data management systems", "Media players", "Web and mobile applications"]
      },
      "embeddedSoftware": {
        "description": "Embedded software controls specialized hardware such as vehicles, industrial machines, robotics, and IoT devices.",
        "context": "Often operates with real-time constraints and limited resources."
      },
      "distributionModels": {
        "customSoftware": "Designed and maintained for a specific organization or workflow.",
        "commercialSoftware": "Packaged and distributed to meet broad market requirements (COTS)."
      }
    },
    "rolesInDevelopment": {
      "description": "Software development is carried out by programmers, software engineers, and software developers whose responsibilities often overlap depending on organizational structure.",
      "note": "Collaboration patterns vary across teams and project scales."
    }
  }
}
